Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# ChatViewController.StreamActive
source: All terminal commands in the linked session will be sent to AI automatically.
de: Alle Terminalbefehle in der verknüpften Sitzung werden automatisch an die KI gesendet.
ja: リンクされたセッション内のすべてのターミナルコマンドが自動的にAIに送信されます。
pt_br: Todos os comandos de terminal na sessão vinculada serão enviados à IA automaticamente.
ru: Все команды терминала в привязанной сессии будут автоматически отправляться в ИИ.
zh_hans: 与关联会话中的所有终端命令将自动发送给AI。

# ChatViewController.StreamPrivacyMessage
source: All terminal content will be sent to AI, which may go to a third party. Ensure this is safe to do before proceeding.
de: Der gesamte Terminalinhalt wird an die KI gesendet, was an Dritte weitergeleitet werden kann. Vergewissern Sie sich, dass dies unbedenklich ist, bevor Sie fortfahren.
ja: すべてのターミナルの内容がAIに送信され、第三者に渡る可能性があります。続行する前に、これが安全であることを確認してください。
pt_br: Todo o conteúdo do terminal será enviado à IA, o que pode ir para terceiros. Certifique-se de que isso é seguro antes de prosseguir.
ru: Всё содержимое терминала будет отправлено в ИИ, что может означать передачу третьей стороне. Прежде чем продолжить, убедитесь, что это безопасно.
zh_hans: 所有终端内容都会发送给 AI，可能会发送给第三方。继续前请确保这样做是安全的。

# ChatViewController.StreamStopped
source: Terminal commands will no longer be sent to AI automatically.
de: Terminalbefehle werden nicht mehr automatisch an die KI gesendet.
ja: ターミナルコマンドは自動的にAIへ送信されなくなります。
pt_br: Os comandos de terminal não serão mais enviados à IA automaticamente.
ru: Команды терминала больше не будут автоматически отправляться в ИИ.
zh_hans: 终端命令将不再自动发送给 AI。

# ChatViewController.StreamStoppedAutomatically
source: Terminal commands will no longer be sent to AI automatically. Automatic sending always terminates when iTerm2 restarts or the current chat changes.
de: Terminalbefehle werden nicht mehr automatisch an die KI gesendet. Das automatische Senden endet immer, wenn iTerm2 neu gestartet wird oder sich der aktuelle Chat ändert.
ja: ターミナルコマンドは自動的にAIへ送信されなくなります。自動送信は、iTerm2を再起動するか現在のチャットが変更されると必ず終了します。
pt_br: Os comandos de terminal não serão mais enviados à IA automaticamente. O envio automático sempre termina quando o iTerm2 reinicia ou o chat atual muda.
ru: Команды терминала больше не будут автоматически отправляться в ИИ. Автоматическая отправка всегда прекращается при перезапуске iTerm2 или смене текущего чата.
zh_hans: 终端命令将不再自动发送给 AI。自动发送仅在 iTerm2 重启或当前聊天内容改变时终止。

# ChatViewController.UnlinkBrowserSession
source: Unlink Web Browser Session
de: Webbrowser-Sitzung trennen
ja: Webブラウザセッションのリンクを解除
pt_br: Desvincular sessão de navegador web
ru: Отвязать сессию веб-браузера
zh_hans: 取消链接网页浏览器会话

# ChatViewController.UnlinkedBrowserNotice
source: This chat is no longer linked to a web browser session.
de: Dieser Chat ist nicht mehr mit einer Webbrowser-Sitzung verknüpft.
ja: このチャットはWebブラウザセッションにリンクされなくなりました。
pt_br: Este chat não está mais vinculado a uma sessão de navegador web.
ru: Этот чат больше не привязан к сессии веб-браузера.
zh_hans: 此聊天会话不再与网页浏览器会话关联。

# ChatViewController.UnlinkedTerminalNotice
source: This chat is no longer linked to a terminal session.
de: Dieser Chat ist nicht mehr mit einer Terminalsitzung verknüpft.
ja: このチャットはターミナルセッションにリンクされなくなりました。
pt_br: Este chat não está mais vinculado a uma sessão de terminal.
ru: Этот чат больше не привязан к сессии терминала.
zh_hans: 此聊天会话不再与终端会话关联。

# ChatViewController.UnlinkTerminalSession
source: Unlink Terminal Session
de: Terminalsitzung trennen
ja: ターミナルセッションのリンクを解除
pt_br: Desvincular sessão de terminal
ru: Отвязать сессию терминала
zh_hans: 取消链接终端会话

# ChatViewController.UnnamedSession
source: Unnamed session
de: Unbenannte Sitzung
ja: 名前のないセッション
pt_br: Sessão sem nome
ru: Безымянная сессия
zh_hans: 未命名会话

# ChatViewController.UnnamedSessionParen
source: (Unnamed session)
de: (Unbenannte Sitzung)
ja: （名前のないセッション）
pt_br: (Sessão sem nome)
ru: (Безымянная сессия)
zh_hans: (未命名会话)

# ChatViewController.UnsupportedMessage
source: This message requires a newer version of iTerm2 to view.
de: Um diese Nachricht anzuzeigen, ist eine neuere Version von iTerm2 erforderlich.
ja: このメッセージを表示するには、新しいバージョンのiTerm2が必要です。
pt_br: Esta mensagem requer uma versão mais recente do iTerm2 para ser visualizada.
ru: Для просмотра этого сообщения требуется более новая версия iTerm2.
zh_hans: 此消息需要较新版本的 iTerm2 才能查看。

# ChatViewController.UntitledChat
source: Untitled Chat
de: Unbenannter Chat
ja: 無題のチャット
pt_br: Chat sem título
ru: Чат без названия
zh_hans: 未命名聊天

# ChatViewController.VectorStoreCreated
source: A vector store was created
de: Ein Vektorspeicher wurde erstellt
ja: ベクトルストアが作成されました
pt_br: Um vector store foi criado
ru: Создано векторное хранилище
zh_hans: 创建了一个向量存储。

# ChatViewController.WaitingForSession
source: Waiting for a session to be selected…
de: Warten auf die Auswahl einer Sitzung…
ja: セッションが選択されるのを待っています…
pt_br: Aguardando a seleção de uma sessão…
ru: Ожидание выбора сессии…
zh_hans: 正在等待选择会话……

# ChatWindowController.ChatAboutTitle
source: Chat about %@
de: Chat über %@
ja: %@ についてのチャット
pt_br: Chat sobre %@
ru: Чат о %@
zh_hans: 关于 %@ 的聊天

# ChatWindowController.ChatNotFound
source: The messages for this chat could not be loaded.
de: Die Nachrichten für diesen Chat konnten nicht geladen werden.
ja: このチャットのメッセージを読み込めませんでした。
pt_br: Não foi possível carregar as mensagens deste chat.
ru: Не удалось загрузить сообщения этого чата.
zh_hans: 无法载入此聊天的消息。

# ChatWindowController.DeleteChatConfirm
source: Are you sure you want to delete %lld chats? This action cannot be undone.
de: Möchten Sie %lld Chats wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.
ja: %lld個のチャットを削除してもよろしいですか？この操作は元に戻せません。
pt_br: Tem certeza de que deseja apagar %lld conversas? Esta ação não pode ser desfeita.
ru: Вы уверены, что хотите удалить %lld чатов? Это действие нельзя отменить.
zh_hans: 确定要删除这 %lld 个对话吗？此操作无法撤销。

# ChatWindowController.DeleteChatHeading
source: Delete %lld Chats?
de: %lld Chats löschen?
ja: %lld個のチャットを削除しますか？
pt_br: Apagar %lld conversas?
ru: Удалить %lld чатов?
zh_hans: 删除 %lld 个对话？

# ChatWindowController.EffortLabel
source: Effort
de: Aufwand
ja: 強度
pt_br: Esforço
ru: Усилие
zh_hans: 强度

# ChatWindowController.EffortPaletteLabel
source: Reasoning Effort
de: Denkaufwand
ja: 推論強度
pt_br: Esforço de raciocínio
ru: Уровень рассуждений
zh_hans: 推理强度

# ChatWindowController.EffortTooltip
source: Select reasoning effort
de: Denkaufwand auswählen
ja: 推論強度を選択
pt_br: Selecionar esforço de raciocínio
ru: Выберите уровень рассуждений
zh_hans: 选择推理强度

# ChatWindowController.ForkedAtPrefix
source: (Forked at
de: (Verzweigt am
ja: (分岐日時:
pt_br: (Bifurcado em
ru: (Разветвлено в
zh_hans: (分支于

# ChatWindowController.ModelLabel
source: Model
de: Modell
ja: モデル
pt_br: Modelo
ru: Модель
zh_hans: 模型

# ChatWindowController.ModelPaletteLabel
source: AI Model
de: KI-Modell
ja: AIモデル
pt_br: Modelo de IA
ru: Модель ИИ
zh_hans: AI 模型

# ChatWindowController.ModelTooltip
source: Select AI model
de: KI-Modell auswählen
ja: AIモデルを選択
pt_br: Selecionar modelo de IA
ru: Выберите модель ИИ
zh_hans: 选择 AI 模型

# ChatWindowController.NewChatTitle
source: New Chat
de: Neuer Chat
ja: 新規チャット
pt_br: Novo chat
ru: Новый чат
zh_hans: 新聊天

# ChatWindowController.OpenFailedMessage
source: AI Chat could not open because of a problem loading the database. Verify there is only one instance of iTerm2 running.
de: KI-Chat konnte nicht geöffnet werden, da beim Laden der Datenbank ein Problem aufgetreten ist. Stellen Sie sicher, dass nur eine Instanz von iTerm2 ausgeführt wird.
ja: データベースの読み込みで問題が発生したため、AIチャットを開けませんでした。iTerm2のインスタンスが1つだけ実行されていることを確認してください。
pt_br: O chat de IA não pôde ser aberto por causa de um problema ao carregar o banco de dados. Verifique se há apenas uma instância do iTerm2 em execução.
ru: Чат ИИ не удалось открыть из-за проблемы с загрузкой базы данных. Убедитесь, что запущен только один экземпляр iTerm2.
zh_hans: AI 聊天无法打开，因为加载数据库时出现问题。请确认只有一个 iTerm2 实例在运行。

# ChatWindowController.ProviderLabel
source: Provider
de: Anbieter
ja: プロバイダ
pt_br: Provedor
ru: Провайдер
zh_hans: 提供者

# ChatWindowController.ProviderPaletteLabel
source: AI Provider
de: KI-Anbieter
ja: AIプロバイダ
pt_br: Provedor de IA
ru: Провайдер ИИ
zh_hans: AI 提供者

# ChatWindowController.ProviderTooltip
source: Select AI provider for new chats
de: KI-Anbieter für neue Chats auswählen
ja: 新規チャット用のAIプロバイダを選択
pt_br: Selecionar provedor de IA para novos chats
ru: Выберите провайдера ИИ для новых чатов
zh_hans: 为新聊天选择 AI 提供者

# ChatWindowController.RenameButton
source: Rename
de: Umbenennen
ja: 名前を変更
pt_br: Renomear
ru: Переименовать
zh_hans: 重命名

# ChatWindowController.RenameChatPrompt
source: Choose a new name for this chat.
de: Wählen Sie einen neuen Namen für diesen Chat.
ja: このチャットの新しい名前を選択してください。
pt_br: Escolha um novo nome para este chat.
ru: Выберите новое имя для этого чата.
zh_hans: 为此聊天选择新名称。

# ChatWindowController.RenameChatTitle
source: Rename Chat
de: Chat umbenennen
ja: チャットの名前を変更
pt_br: Renomear chat
ru: Переименовать чат
zh_hans: 重命名聊天

# ChatWindowController.RenameFailedHeading
source: Rename Failed
de: Umbenennen fehlgeschlagen
ja: 名前の変更に失敗しました
pt_br: Falha ao renomear
ru: Не удалось переименовать
zh_hans: 重命名失败

# ChatWindowController.RenameFailedMessage
source: The chat could not be renamed.
de: Der Chat konnte nicht umbenannt werden.
ja: チャットの名前を変更できませんでした。
pt_br: Não foi possível renomear o chat.
ru: Не удалось переименовать чат.
zh_hans: 聊天无法重命名。

# ChatWindowController.SessionLabel
source: Session
de: Sitzung
ja: セッション
pt_br: Sessão
ru: Сессия
zh_hans: 会话

# ChatWindowController.SessionPaletteLabel
source: Link Session
de: Sitzung verknüpfen
ja: セッションをリンク
pt_br: Vincular sessão
ru: Привязать сессию
zh_hans: 链接会话

# ChatWindowController.SessionTooltip
source: Link or unlink terminal/browser session
de: Terminal-/Browsersitzung verknüpfen oder trennen
ja: ターミナル/ブラウザセッションをリンクまたは解除
pt_br: Vincular ou desvincular sessão de terminal/navegador
ru: Привязать или отвязать сессию терминала/браузера
zh_hans: 链接或取消链接终端/浏览器会话

# ChatWindowController.SpeedLabel
source: Speed
de: Geschwindigkeit
ja: 速度
pt_br: Velocidade
ru: Скорость
zh_hans: 速度

# ChatWindowController.SpeedPaletteLabel
source: AI Speed
de: KI-Geschwindigkeit
ja: AI速度
pt_br: Velocidade da IA
ru: Скорость ИИ
zh_hans: AI 速度

# ChatWindowController.SpeedTooltip
source: Select AI service tier
de: KI-Servicestufe auswählen
ja: AIサービス階層を選択
pt_br: Selecionar nível de serviço da IA
ru: Выберите уровень обслуживания ИИ
zh_hans: 选择 AI 服务层级

# ChatWindowController.ThinkingLabel
source: Thinking
de: Denken
ja: 思考
pt_br: Raciocínio
ru: Мышление
zh_hans: 思考

# ChatWindowController.ThinkingPaletteLabel
source: Toggle Thinking
de: Denken ein-/ausschalten
ja: 思考の切り替え
pt_br: Alternar raciocínio
ru: Переключить режим мышления
zh_hans: 切换思考

# ChatWindowController.ThinkingTooltip
source: Enable or disable thinking/reasoning mode
de: Denk-/Schlussfolgerungsmodus aktivieren oder deaktivieren
ja: 思考/推論モードを有効または無効にする
pt_br: Ativar ou desativar o modo de pensamento/raciocínio
ru: Включить или отключить режим мышления/рассуждений
zh_hans: 启用或停用思考/推理模式

# ChatWindowController.ToggleChatList
source: Toggle Chat List
de: Chatliste ein-/ausblenden
ja: チャットリストの切り替え
pt_br: Alternar lista de chats
ru: Переключить список чатов
zh_hans: 切换聊天列表

# ChatWindowController.ToggleChatListTooltip
source: Show or hide the chat list
de: Chatliste ein- oder ausblenden
ja: チャットリストを表示または非表示
pt_br: Mostrar ou ocultar a lista de chats
ru: Показать или скрыть список чатов
zh_hans: 显示或隐藏聊天列表

# ChatWindowController.WebSearchLabel
source: Web Search
de: Websuche
ja: Web検索
pt_br: Busca na web
ru: Веб-поиск
zh_hans: 网页搜索

# ChatWindowController.WebSearchPaletteLabel
source: Toggle Web Search
de: Websuche ein-/ausschalten
ja: Web検索の切り替え
pt_br: Alternar busca na web
ru: Переключить веб-поиск
zh_hans: 切换网页搜索

# ChatWindowController.WebSearchTooltip
source: Enable or disable web search
de: Websuche aktivieren oder deaktivieren
ja: Web検索を有効または無効にする
pt_br: Ativar ou desativar a busca na web
ru: Включить или отключить веб-поиск
zh_hans: 启用或停用网页搜索

# ChatWindowController.WindowTitle
source: AI Chat
de: KI-Chat
ja: AIチャット
pt_br: Chat de IA
ru: Чат ИИ
zh_hans: AI 聊天

# ClaudeCode.Disable
source: Disable
de: Deaktivieren
ja: 無効にする
pt_br: Desativar
ru: Отключить
zh_hans: 停用

# ClaudeCode.DisableAPIBody
source: The installer enabled iTerm2’s Python API. Other scripts or integrations may be using it now. Leave it enabled, or turn it off?
de: Das Installationsprogramm hat die Python-API von iTerm2 aktiviert. Andere Skripte oder Integrationen verwenden sie möglicherweise bereits. Soll sie aktiviert bleiben oder abgeschaltet werden?
ja: インストーラーはiTerm2のPython APIを有効にしました。現在、他のスクリプトや連携機能がこれを使用している可能性があります。有効のままにしますか、それともオフにしますか？
pt_br: O instalador ativou a Python API do iTerm2. Outros scripts ou integrações podem estar usando-a agora. Deixar ativada, ou desativá-la?
ru: Установщик включил Python API iTerm2. Сейчас его могут использовать другие скрипты или интеграции. Оставить включённым или отключить?
zh_hans: 安装程序启用了 iTerm2 的 Python API。其他脚本或集成现在可能正在使用它。保持启用，还是将其关闭？

# ClaudeCode.DisableAPITitle
source: Disable the Python API?
de: Python-API deaktivieren?
ja: Python APIを無効にしますか？
pt_br: Desativar a Python API?
ru: Отключить Python API?
zh_hans: 停用 Python API？

# ClaudeCode.HookMalformed
source: ~/.claude/settings.json couldn’t be parsed as JSON. Open it in a text editor and check it for syntax errors.
de: ~/.claude/settings.json konnte nicht als JSON geparst werden. Öffnen Sie sie in einem Texteditor und prüfen Sie sie auf Syntaxfehler.
ja: ~/.claude/settings.jsonをJSONとして解析できませんでした。テキストエディタで開いて構文エラーを確認してください。
pt_br: Não foi possível analisar ~/.claude/settings.json como JSON. Abra-o em um editor de texto e verifique se há erros de sintaxe.
ru: Не удалось разобрать ~/.claude/settings.json как JSON. Откройте файл в текстовом редакторе и проверьте синтаксис.
zh_hans: ~/.claude/settings.json 无法被解析为 JSON。请在文本编辑器中打开并检查语法错误。

# ClaudeCode.HookRemovalFailedBody
source: %@ Continue removing the workgroup and triggers anyway? cc-status will keep running until you fix the underlying issue and try again.
de: %@ Sollen die Arbeitsgruppe und die Trigger trotzdem entfernt werden? cc-status läuft weiter, bis Sie das zugrunde liegende Problem beheben und es erneut versuchen.
ja: %@ それでもワークグループとトリガーの削除を続けますか？根本的な問題を修正して再試行するまで、cc-statusは動作し続けます。
pt_br: %@ Continuar removendo o grupo de trabalho e os gatilhos mesmo assim? O cc-status continuará em execução até você corrigir o problema subjacente e tentar novamente.
ru: %@ Всё равно продолжить удаление рабочей группы и триггеров? cc-status будет продолжать работать, пока вы не устраните проблему и не повторите попытку.
zh_hans: %@ 继续移除工作组 和触发器？cc-status 将继续运行，直到你修复根本问题并重试。

# ClaudeCode.HookRemovalFailedTitle
source: Couldn’t Remove Hooks
de: Hooks konnten nicht entfernt werden
ja: フックを削除できませんでした
pt_br: Não foi possível remover os hooks
ru: Не удалось удалить хуки
zh_hans: 无法移除钩子

# ClaudeCode.HookUnreadable
source: Could not read ~/.claude/settings.json — check the file’s permissions.
de: ~/.claude/settings.json konnte nicht gelesen werden. Prüfen Sie die Dateiberechtigungen.
ja: ~/.claude/settings.jsonを読み込めませんでした。ファイルのアクセス権を確認してください。
pt_br: Não foi possível ler ~/.claude/settings.json. Verifique as permissões do arquivo.
ru: Не удалось прочитать ~/.claude/settings.json. Проверьте права доступа к файлу.
zh_hans: 无法读取 ~/.claude/settings.json — 请检查文件的权限。

# ClaudeCode.HookWriteFailed
source: Could not write to ~/.claude/settings.json — check the file’s permissions.
de: ~/.claude/settings.json konnte nicht geschrieben werden. Prüfen Sie die Dateiberechtigungen.
ja: ~/.claude/settings.jsonに書き込めませんでした。ファイルのアクセス権を確認してください。
pt_br: Não foi possível gravar em ~/.claude/settings.json. Verifique as permissões do arquivo.
ru: Не удалось записать в ~/.claude/settings.json. Проверьте права доступа к файлу.
zh_hans: 无法写入 ~/.claude/settings.json — 请检查文件的权限。

# ClaudeCode.LeaveEnabled
source: Leave Enabled
de: Aktiviert lassen
ja: 有効のままにする
pt_br: Deixar ativada
ru: Оставить включённым
zh_hans: 保持启用

# ClaudeCode.Uninstall
source: Uninstall
de: Deinstallieren
ja: アンインストール
pt_br: Desinstalar
ru: Удалить
zh_hans: 卸载

# ClaudeCode.UninstallBody
source: This removes the cc-status hook from ~/.claude/settings.json, the Claude Code workgroup from your settings, and the Enter/Exit Workgroup triggers from every profile. You can reinstall any time using iTerm2 > Install Claude Code Integration.
de: Dies entfernt den cc-status-Hook aus ~/.claude/settings.json, die Claude-Code-Arbeitsgruppe aus Ihren Einstellungen und die Trigger zum Betreten/Verlassen der Arbeitsgruppe aus jedem Profil. Eine erneute Installation ist jederzeit über iTerm2 > Claude-Code-Integration installieren möglich.
ja: これにより、~/.claude/settings.jsonからcc-statusフックが削除され、設定からClaude Codeワークグループが削除され、すべてのプロファイルからワークグループ参加/退出トリガーが削除されます。iTerm2 > Claude Code連携をアンインストールからいつでも再インストールできます。
pt_br: Isso remove o hook cc-status de ~/.claude/settings.json, o workgroup do Claude Code dos seus ajustes e os gatilhos de entrar/sair do workgroup de todos os perfis. Você pode reinstalar a qualquer momento usando iTerm2 > Instalar integração do Claude Code.
ru: Это удалит хук cc-status из ~/.claude/settings.json, рабочую группу Claude Code из ваших настроек и триггеры Enter/Exit Workgroup из всех профилей. Переустановить интеграцию можно в любой момент через iTerm2 > Install Claude Code Integration.
zh_hans: 这将从 ~/.claude/settings.json 中移除 cc-status 钩子，从你的设置中移除 Claude Code 工作组，并从每个配置文件中移除“进入/退出工作组”触发器。你可以随时通过“iTerm2 > 安装 Claude Code 集成”重新安装。

# ClaudeCode.UninstallTitle
source: Uninstall Claude Code Integration?
de: Claude-Code-Integration deinstallieren?
ja: Claude Code連携をアンインストールしますか？
pt_br: Desinstalar a integração do Claude Code?
ru: Удалить интеграцию Claude Code?
zh_hans: 卸载 Claude Code 集成？

# ClaudeCodeMode.DontShowAgain
source: Don't Show Again
de: Nicht mehr anzeigen
ja: 今後表示しない
pt_br: Não mostrar novamente
ru: Больше не показывать
zh_hans: 不再显示

# ClaudeCodeMode.OfferTitle
source: Claude Code is running. Want to try the Claude Code integration?
de: Claude Code wird ausgeführt. Möchten Sie die Claude-Code-Integration ausprobieren?
ja: Claude Codeが実行中です。Claude Code連携を試してみますか？
pt_br: O Claude Code está em execução. Quer experimentar a integração do Claude Code?
ru: Claude Code запущен. Хотите попробовать интеграцию Claude Code?
zh_hans: Claude Code 正在运行。要尝试 Claude Code 集成吗？

# ClaudeCodeMode.TryItNow
source: Try It Now
de: Jetzt ausprobieren
ja: 今すぐ試す
pt_br: Experimentar agora
ru: Попробовать сейчас
zh_hans: 立即尝试

# ClaudeCodeOnboarding.AutoEnterWorkgroupTitle
source: Auto-Enter Workgroup
de: Arbeitsgruppe automatisch betreten
ja: ワークグループの自動参加
pt_br: Entrar no workgroup automaticamente
ru: Автовход в рабочую группу
zh_hans: 自动进入工作组

# ClaudeCodeOnboarding.Back
source: Back
de: Zurück
ja: 戻る
pt_br: Voltar
ru: Назад
zh_hans: 后退

# ClaudeCodeOnboarding.BeforeYouStart
source: Before You Start
de: Bevor Sie beginnen
ja: 開始する前に
pt_br: Antes de começar
ru: Прежде чем начать
zh_hans: 开始之前

# ClaudeCodeOnboarding.DoIt
source: Do It
de: Ausführen
ja: 実行する
pt_br: Fazer
ru: Выполнить
zh_hans: 执行

# ClaudeCodeOnboarding.DynamicProfilesWarningBody
source: These profiles are dynamic and not marked “rewritable,” so iTerm2 normally regenerates them from disk and any change here would be lost: %@ iTerm2 can write the triggers back to dynamic profiles when they’re marked rewritable. Rewriting can change the order of values in the underlying file.
de: Diese Profile sind dynamisch und nicht als „überschreibbar“ markiert. iTerm2 erzeugt sie daher normalerweise neu aus der Datei, und jede Änderung hier würde verloren gehen: %@ iTerm2 kann die Trigger in dynamische Profile zurückschreiben, wenn diese als überschreibbar markiert sind. Das Zurückschreiben kann die Reihenfolge der Werte in der zugrunde liegenden Datei ändern.
ja: これらのプロファイルは動的で「書き込み可能」としてマークされていないため、iTerm2は通常ディスクから再生成し、ここでの変更は失われます。 %@ iTerm2は、動的プロファイルが書き込み可能としてマークされている場合、トリガーをそのプロファイルに書き戻すことができます。書き戻しを行うと、元のファイル内の値の順序が変わることがあります。
pt_br: Estes perfis são dinâmicos e não estão marcados como “regraváveis”, então o iTerm2 normalmente os regenera a partir do disco e qualquer alteração aqui seria perdida: %@ O iTerm2 pode gravar os gatilhos de volta nos perfis dinâmicos quando eles estão marcados como regraváveis. A regravação pode alterar a ordem dos valores no arquivo subjacente.
ru: Эти профили динамические и не помечены как «доступные для перезаписи», поэтому обычно iTerm2 регенерирует их с диска, и любые изменения здесь будут потеряны: %@ iTerm2 может записывать триггеры обратно в динамические профили, если они помечены как доступные для перезаписи. Перезапись может изменить порядок значений в исходном файле.
zh_hans: 这些配置文件是动态的，且未标记为“可重写”，因此 iTerm2 通常会从磁盘重新生成它们，此处的任何更改都会丢失： %@ iTerm2 可以在配置文件被标记为可重写后，将触发器写回动态配置文件。重写可能会更改底层文件中值的顺序。

# ClaudeCodeOnboarding.DynamicProfilesWarningHeading
source: Dynamic Profiles Selected
de: Dynamische Profile ausgewählt
ja: 動的プロファイルが選択されています
pt_br: Perfis dinâmicos selecionados
ru: Выбраны динамические профили
zh_hans: 已选择动态配置文件

# ClaudeCodeOnboarding.Enable
source: Enable
de: Aktivieren
ja: 有効にする
pt_br: Ativar
ru: Включить
zh_hans: 启用

# ClaudeCodeOnboarding.EnablePythonAPIDescription
source: The Claude Code integration relies on iTerm2’s Python API to find sessions running Claude and track their status. The Python API is currently disabled. Setup can’t continue until it is enabled. Click Enable to turn it on.
de: Die Claude-Code-Integration benötigt die Python-API von iTerm2, um Sitzungen zu finden, in denen Claude läuft, und deren Status zu verfolgen. Die Python-API ist derzeit deaktiviert. Die Einrichtung kann erst fortgesetzt werden, wenn sie aktiviert ist. Klicken Sie auf Aktivieren, um sie einzuschalten.
ja: Claude Code連携は、Claudeを実行しているセッションを見つけてその状態を追跡するために、iTerm2のPython APIを利用します。 Python APIは現在無効になっています。有効にしない限りセットアップを続行できません。「有効にする」をクリックしてオンにしてください。
pt_br: A integração do Claude Code depende da API Python do iTerm2 para encontrar sessões executando o Claude e acompanhar seu status. A API Python está desativada no momento. A configuração não pode continuar até que ela seja ativada. Clique em Ativar para ligá-la.
ru: Интеграция Claude Code использует Python API iTerm2 для поиска сессий с запущенным Claude и отслеживания их статуса. Python API сейчас отключён. Настройка не может продолжиться, пока он не будет включён. Нажмите «Включить», чтобы включить его.
zh_hans: Claude Code 集成依赖 iTerm2 的 Python API 来查找运行 Claude 的会话并跟踪其状态。 Python API 当前已停用。在启用之前，设置无法继续。点按“启用”将其打开。

# ClaudeCodeOnboarding.EnablePythonAPITitle
source: Enable Python API
de: Python-API aktivieren
ja: Python APIを有効にする
pt_br: Ativar API Python
ru: Включить Python API
zh_hans: 启用 Python API

# ClaudeCodeOnboarding.FailedToInstallHook
source: Failed to install hook
de: Hook konnte nicht installiert werden
ja: フックのインストールに失敗しました
pt_br: Falha ao instalar o hook
ru: Не удалось установить хук
zh_hans: 安装钩子失败

# ClaudeCodeOnboarding.FailedToWriteSettings
source: Could not write to %1$@: %2$@
de: %1$@ konnte nicht geschrieben werden: %2$@
ja: %1$@ に書き込めませんでした: %2$@
pt_br: Não foi possível gravar em %1$@: %2$@
ru: Не удалось записать в %1$@: %2$@
zh_hans: 无法写入 %1$@: %2$@

# ClaudeCodeOnboarding.Install
source: Install
de: Installieren
ja: インストール
pt_br: Instalar
ru: Установить
zh_hans: 安装
